In [1]:
import numpy as np
import pandas as pd

In [ ]:
#1. 데이터 생성하는법

In [2]:
#numpy
a1 = np.array([1,2,3,4,5])
a1

array([1, 2, 3, 4, 5])

In [3]:
#Series
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
s2 = pd.Series({
    'a' : [1,2,3],
    'b' : [3,4,5],
    'c' : [1,4,6]
})
s2

a    [1, 2, 3]
b    [3, 4, 5]
c    [1, 4, 6]
dtype: object

In [9]:
#DataFrame
d1 = pd.DataFrame(
    [['이름1',51,'생존'],
     ['이름2',13,'생존'],
    ['이름3',21,'사망']],
     index = [0,1,2], columns = ['이름','나이','상태']
)
d1

    이름  나이  상태
0  이름1  51  생존
1  이름2  13  생존
2  이름3  21  사망

In [13]:
d2 = pd.DataFrame({
    '이름' : ['이름1','이름2','이름3'],
    '나이' : [51,13,21],
    '상태' : ['생존','생존','사망']
})
d2

    이름  나이  상태
0  이름1  51  생존
1  이름2  13  생존
2  이름3  21  사망

In [ ]:
#2. 데이터 불러올 때 특정 column 조작법

In [22]:
flight = pd.read_csv('./Flight Price Prediction/Clean_Dataset.csv', encoding = 'cp949', 
                     index_col = 'airline', usecols = ['airline','flight','departure_time','duration'])
flight.head(10)

           flight departure_time  duration
airline
SpiceJet  SG-8709        Evening      2.17
SpiceJet  SG-8157  Early_Morning      2.33
AirAsia    I5-764  Early_Morning      2.17
Vistara    UK-995        Morning      2.25
Vistara    UK-963        Morning      2.33
Vistara    UK-945        Morning      2.33
Vistara    UK-927        Morning      2.08
Vistara    UK-951      Afternoon      2.17
GO_FIRST   G8-334  Early_Morning      2.17
GO_FIRST   G8-336      Afternoon      2.25

In [30]:
pd.crosstab(index = flight['flight'], columns = flight['departure_time'], values=flight['duration'], aggfunc=np.mean)

C:\Users\Hane\AppData\Local\Temp\ipykernel_21532\2405989657.py:1: FutureWarning: The provided callable <function mean at 0x0000020BBAEDDC60> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.crosstab(index = flight['flight'], columns = flight['departure_time'], values=flight['duration'], aggfunc=np.mean)

departure_time,Afternoon,Early_Morning,Evening,Late_Night,Morning,Night
flight,,,,,,
6E-102,NaN,NaN,3.208718,NaN,NaN,NaN
6E-105,7.500000,NaN,NaN,NaN,NaN,NaN
6E-113,NaN,NaN,NaN,NaN,5.660612,NaN
6E-121,NaN,5.645,NaN,NaN,NaN,NaN
6E-123,6.750000,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
UK-988,NaN,NaN,NaN,NaN,NaN,16.382245
UK-993,8.829067,NaN,NaN,NaN,NaN,NaN
UK-994,NaN,NaN,NaN,NaN,9.325067,NaN
UK-995,NaN,NaN,NaN,NaN,10.471875,NaN
UK-996,NaN,NaN,18.559123,NaN,NaN,NaN

#데이터 정보 보는법

In [37]:
flight.head(3)
flight.tail(3)

print("shape : ", flight.shape)
print("col, ind : ", flight.columns, flight.index)
print()
print()

flight.info()
flight.describe()

shape :  (300153, 3)
col, ind :  Index(['flight', 'departure_time', 'duration'], dtype='object') Index(['SpiceJet', 'SpiceJet', 'AirAsia', 'Vistara', 'Vistara', 'Vistara',
       'Vistara', 'Vistara', 'GO_FIRST', 'GO_FIRST',
       ...
       'Air_India', 'Air_India', 'Air_India', 'Air_India', 'Air_India',
       'Vistara', 'Vistara', 'Vistara', 'Vistara', 'Vistara'],
      dtype='object', name='airline', length=300153)


<class 'pandas.core.frame.DataFrame'>
Index: 300153 entries, SpiceJet to Vistara
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   flight          300153 non-null  object
 1   departure_time  300153 non-null  object
 2   duration        300153 non-null  float64
dtypes: float64(1), object(2)
memory usage: 9.2+ MB

            duration
count  300153.000000
mean       12.221021
std         7.191997
min         0.830000
25%         6.830000
50%        11.250000
75%        16.170000
max        49.830000

In [39]:
print(flight.value_counts())

flight  departure_time  duration
UK-772  Morning         10.50       236
UK-822  Morning         11.17       226
UK-826  Afternoon       8.42        221
UK-828  Early_Morning   13.92       214
UK-878  Afternoon       9.83        201
                                   ...
AI-503  Evening         25.67         1
AI-765  Night           24.50         1
                        24.83         1
UK-860  Early_Morning   37.92         1
SG-329  Afternoon       26.08         1
Name: count, Length: 11575, dtype: int64

데이터 조건 변수로 저장 후 합치는 법

In [43]:
flight

           flight departure_time  duration
airline
SpiceJet  SG-8709        Evening      2.17
SpiceJet  SG-8157  Early_Morning      2.33
AirAsia    I5-764  Early_Morning      2.17
Vistara    UK-995        Morning      2.25
Vistara    UK-963        Morning      2.33
...           ...            ...       ...
Vistara    UK-822        Morning     10.08
Vistara    UK-826      Afternoon     10.42
Vistara    UK-832  Early_Morning     13.83
Vistara    UK-828  Early_Morning     10.00
Vistara    UK-822        Morning     10.08

[300153 rows x 3 columns]

In [45]:
time_temp = flight['departure_time'] == 'Evening'
dur_temp = flight['duration'] >= 5
flight[time_temp & dur_temp]

           flight departure_time  duration
airline
AirAsia    I5-747        Evening     12.25
AirAsia    I5-747        Evening     16.33
GO_FIRST   G8-103        Evening     15.67
Vistara    UK-813        Evening     14.67
Vistara    UK-817        Evening     16.17
...           ...            ...       ...
Vistara    UK-834        Evening     23.58
Vistara    UK-834        Evening     26.42
Air_India  AI-539        Evening      6.58
Air_India  AI-539        Evening     16.00
Air_India  AI-539        Evening     18.92

[53315 rows x 3 columns]

In [46]:
dur_temp

airline
SpiceJet    False
SpiceJet    False
AirAsia     False
Vistara     False
Vistara     False
            ...
Vistara      True
Vistara      True
Vistara      True
Vistara      True
Vistara      True
Name: duration, Length: 300153, dtype: bool

In [48]:
flight = pd.read_csv('./Flight Price Prediction/Clean_Dataset.csv', encoding = 'cp949')
flight.head(10)

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
5,5,Vistara,UK-945,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.33,1,5955
6,6,Vistara,UK-927,Delhi,Morning,zero,Morning,Mumbai,Economy,2.08,1,6060
7,7,Vistara,UK-951,Delhi,Afternoon,zero,Evening,Mumbai,Economy,2.17,1,6060
8,8,GO_FIRST,G8-334,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.17,1,5954
9,9,GO_FIRST,G8-336,Delhi,Afternoon,zero,Evening,Mumbai,Economy,2.25,1,5954

In [50]:
flight.insert(loc=3, column = 'ID', value = flight['flight'] + '-' + flight['departure_time'])
flight

,Unnamed: 0,airline,flight,ID,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,new_col
0,0,SpiceJet,SG-8709,SG-8709-Evening,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,217.0
1,1,SpiceJet,SG-8157,SG-8157-Early_Morning,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,233.0
2,2,AirAsia,I5-764,I5-764-Early_Morning,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956,217.0
3,3,Vistara,UK-995,UK-995-Morning,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,225.0
4,4,Vistara,UK-963,UK-963-Morning,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,233.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,UK-822-Morning,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265,1008.0
300149,300149,Vistara,UK-826,UK-826-Afternoon,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105,1042.0
300150,300150,Vistara,UK-832,UK-832-Early_Morning,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099,1383.0
300151,300151,Vistara,UK-828,UK-828-Early_Morning,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585,1000.0
300152,300152,Vistara,UK-822,UK-822-Morning,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585,1008.0

In [57]:
flight.drop('new_col', axis=1, inplace=True)

In [75]:
flight = flight.rename({
    flight.columns[0] : 'no', 'flight' : 'plane'
}, axis=1)
flight.sort_values(by='departure_time')

,no,airline,plane,ID,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
170814,170814,Indigo,6E-6366,6E-6366-Afternoon,Hyderabad,Afternoon,one,Evening,Kolkata,Economy,4.17,3,5293
152935,152935,Indigo,6E-7076,6E-7076-Afternoon,Hyderabad,Afternoon,one,Night,Delhi,Economy,8.67,6,10386
280230,280230,Vistara,UK-880,UK-880-Afternoon,Hyderabad,Afternoon,one,Night,Mumbai,Business,10.42,48,58315
152936,152936,Vistara,UK-878,UK-878-Afternoon,Hyderabad,Afternoon,one,Night,Delhi,Economy,9.00,6,10753
101561,101561,Indigo,6E-161,6E-161-Afternoon,Bangalore,Afternoon,one,Evening,Mumbai,Economy,6.08,43,3957
...,...,...,...,...,...,...,...,...,...,...,...,...,...
245974,245974,Vistara,UK-866,UK-866-Night,Bangalore,Night,one,Evening,Delhi,Business,20.42,16,54841
245976,245976,Vistara,UK-866,UK-866-Night,Bangalore,Night,one,Morning,Delhi,Business,12.00,16,57081
245979,245979,Vistara,UK-866,UK-866-Night,Bangalore,Night,one,Morning,Delhi,Business,13.33,16,57081
122993,122993,Vistara,UK-774,UK-774-Night,Kolkata,Night,one,Evening,Delhi,Economy,21.50,23,6461
150076,150076,Indigo,6E-6172,6E-6172-Night,Kolkata,Night,one,Early_Morning,Chennai,Economy,6.58,24,3269

In [81]:
flight = pd.read_csv('./Flight Price Prediction/Clean_Dataset.csv', encoding = 'cp949',
                    usecols=['airline','flight','duration'])
flight.head(1)

    airline   flight  duration
0  SpiceJet  SG-8709      2.17

In [93]:
flight.groupby(['airline','flight']).aggregate([np.sum,np.mean])

C:\Users\Hane\AppData\Local\Temp\ipykernel_21532\1455082177.py:1: FutureWarning: The provided callable <function sum at 0x0000020BBAEDCB80> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  flight.groupby(['airline','flight']).aggregate([np.sum,np.mean])
C:\Users\Hane\AppData\Local\Temp\ipykernel_21532\1455082177.py:1: FutureWarning: The provided callable <function mean at 0x0000020BBAEDDC60> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  flight.groupby(['airline','flight']).aggregate([np.sum,np.mean])

                 duration
                      sum       mean
airline flight
AirAsia I5-1228    961.19   6.674931
        I5-1229   2902.72   7.114510
        I5-1321    438.65   5.284940
        I5-1426   1359.72   9.782158
        I5-1427     28.66  14.330000
...                   ...        ...
Vistara UK-988   22623.88  16.382245
        UK-993    8043.28   8.829067
        UK-994   11870.81   9.325067
        UK-995   10723.20  10.471875
        UK-996   23495.85  18.559123

[1561 rows x 2 columns]

In [99]:
flight.set_index(['airline','flight']).groupby(level=[0,1]).mean()

                  duration
airline flight
AirAsia I5-1228   6.674931
        I5-1229   7.114510
        I5-1321   5.284940
        I5-1426   9.782158
        I5-1427  14.330000
...                    ...
Vistara UK-988   16.382245
        UK-993    8.829067
        UK-994    9.325067
        UK-995   10.471875
        UK-996   18.559123

[1561 rows x 1 columns]

In [102]:
flight = pd.read_csv('./Flight Price Prediction/Clean_Dataset.csv', encoding = 'cp949')
flight.head(3)

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956

#stack 과 unstack

In [130]:
df1 = pd.DataFrame({
    'name' : ['A','B','C','D'],
    'flight' : ['SpiceJet','AirAsia','SpiceJet','5G'],
    'depatrue_time' : ['Night','Morning','Noon','Noon']
})
df2 = pd.DataFrame({
    'name' : ['A', 'A', 'B', 'C', 'C'],
    'product' : ['예빛','빛나','민아','예은','예은'],
    'purch_amt' : [10,20,15,30,50]
})

In [131]:
df1, df2

(  name    flight depatrue_time
 0    A  SpiceJet         Night
 1    B   AirAsia       Morning
 2    C  SpiceJet          Noon
 3    D        5G          Noon,
   name product  purch_amt
 0    A      예빛         10
 1    A      빛나         20
 2    B      민아         15
 3    C      예은         30
 4    C      예은         50)

C:\Users\Hane\AppData\Local\Temp\ipykernel_21532\3661414538.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df1.set_index(['name', 'flight']).unstack(0).stack(1)

              depatrue_time
flight   name
5G       D             Noon
AirAsia  B          Morning
SpiceJet A            Night
         C             Noon